{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "!{sys.executable} -m pip install SPARQLWrapper\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>movie</th>\n",
       "      <th>uri</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>781</td>\n",
       "      <td>Stealing Beauty (1996)</td>\n",
       "      <td>http://dbpedia.org/resource/Stealing_Beauty</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1799</td>\n",
       "      <td>Suicide Kings (1997)</td>\n",
       "      <td>http://dbpedia.org/resource/Suicide_Kings</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>521</td>\n",
       "      <td>Romeo Is Bleeding (1993)</td>\n",
       "      <td>http://dbpedia.org/resource/Romeo_Is_Bleeding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3596</td>\n",
       "      <td>Screwed (2000)</td>\n",
       "      <td>http://dbpedia.org/resource/Screwed_(2000_film)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>3682</td>\n",
       "      <td>Magnum Force (1973)</td>\n",
       "      <td>http://dbpedia.org/resource/Magnum_Force</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>2635</td>\n",
       "      <td>Mummy's Curse, The (1944)</td>\n",
       "      <td>http://dbpedia.org/resource/The_Mummy's_Curse</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>1590</td>\n",
       "      <td>Event Horizon (1997)</td>\n",
       "      <td>http://dbpedia.org/resource/Event_Horizon_(film)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>116</td>\n",
       "      <td>Anne Frank Remembered (1995)</td>\n",
       "      <td>http://dbpedia.org/resource/Anne_Frank_Remembered</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>3719</td>\n",
       "      <td>Love's Labour's Lost (2000)</td>\n",
       "      <td>http://dbpedia.org/resource/Love's_Labour's_Lo...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>3811</td>\n",
       "      <td>Breaker Morant (1980)</td>\n",
       "      <td>http://dbpedia.org/resource/Breaker_Morant_(film)</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     id                         movie  \\\n",
       "0   781        Stealing Beauty (1996)   \n",
       "1  1799          Suicide Kings (1997)   \n",
       "2   521      Romeo Is Bleeding (1993)   \n",
       "3  3596                Screwed (2000)   \n",
       "4  3682           Magnum Force (1973)   \n",
       "5  2635     Mummy's Curse, The (1944)   \n",
       "6  1590          Event Horizon (1997)   \n",
       "7   116  Anne Frank Remembered (1995)   \n",
       "8  3719   Love's Labour's Lost (2000)   \n",
       "9  3811         Breaker Morant (1980)   \n",
       "\n",
       "                                                 uri  \n",
       "0        http://dbpedia.org/resource/Stealing_Beauty  \n",
       "1          http://dbpedia.org/resource/Suicide_Kings  \n",
       "2      http://dbpedia.org/resource/Romeo_Is_Bleeding  \n",
       "3    http://dbpedia.org/resource/Screwed_(2000_film)  \n",
       "4           http://dbpedia.org/resource/Magnum_Force  \n",
       "5      http://dbpedia.org/resource/The_Mummy's_Curse  \n",
       "6   http://dbpedia.org/resource/Event_Horizon_(film)  \n",
       "7  http://dbpedia.org/resource/Anne_Frank_Remembered  \n",
       "8  http://dbpedia.org/resource/Love's_Labour's_Lo...  \n",
       "9  http://dbpedia.org/resource/Breaker_Morant_(film)  "
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.read_csv(\"dbpedia.tsv\", sep='\\t', names=['id','movie','uri'], header=None)\n",
    "df.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "#Query for Starrings\n",
    "#print(\"Starrings\")\n",
    "\n",
    "#uri=\"http://dbpedia.org/resource/Event_Horizon_(film)\"\n",
    "uri=\"http://dbpedia.org/resource/Romeo_Is_Bleeding\"\n",
    "\n",
    "dict_info = {}\n",
    "def query_sparql(URI):\n",
    "    sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")\n",
    "    sparql.setQuery(\"\"\"\n",
    "        PREFIX dbpediaO: <http://dbpedia.org/ontology/>\n",
    "        SELECT ?list ?name\n",
    "        WHERE {\n",
    "         VALUES ?s {<%s>}\n",
    "         ?s dbpediaO:starring ?list .\n",
    "         ?list foaf:name ?name . }\n",
    "    \"\"\" % URI)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    results = sparql.query().convert()\n",
    "\n",
    "    dict_info['starring']=[]\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        dict_info['starring'].append(result[\"name\"][\"value\"])\n",
    "        #print(result[\"name\"][\"value\"])\n",
    "        \n",
    "    #Query for director\n",
    "    #print(\"\\nDirector\")\n",
    "    sparql.setQuery(\"\"\"\n",
    "        PREFIX dbpediaO: <http://dbpedia.org/ontology/>\n",
    "        SELECT ?list ?name\n",
    "        WHERE {\n",
    "         VALUES ?s {<%s>}\n",
    "         ?s dbpediaO:director ?list .\n",
    "         ?list foaf:name ?name . }\n",
    "    \"\"\" % URI)\n",
    "    results = sparql.query().convert()\n",
    "\n",
    "\n",
    "\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        dict_info['director']=result[\"name\"][\"value\"]\n",
    "        #print(result[\"name\"][\"value\"])\n",
    "    #print(dict_info)\n",
    "    return dict_info\n",
    "\n",
    "print(query_sparql(uri))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [],
   "source": [
    "db=df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\KaiLo\\Anaconda3\\lib\\site-packages\\ipykernel_launcher.py:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.\n",
      "  \n",
      "C:\\Users\\KaiLo\\Anaconda3\\lib\\site-packages\\ipykernel_launcher.py:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.\n",
      "  This is separate from the ipykernel package so we can avoid doing imports until\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>movie</th>\n",
       "      <th>uri</th>\n",
       "      <th>director</th>\n",
       "      <th>starring</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>781</td>\n",
       "      <td>Stealing Beauty (1996)</td>\n",
       "      <td>http://dbpedia.org/resource/Stealing_Beauty</td>\n",
       "      <td>Bernardo Bertolucci</td>\n",
       "      <td>Sinéad Cusack,Joseph Fiennes,Rachel Weisz,Jere...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1799</td>\n",
       "      <td>Suicide Kings (1997)</td>\n",
       "      <td>http://dbpedia.org/resource/Suicide_Kings</td>\n",
       "      <td>Peter O'Fallon</td>\n",
       "      <td>Henry Thomas,Denis Leary,Christopher Walken,Ja...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>521</td>\n",
       "      <td>Romeo Is Bleeding (1993)</td>\n",
       "      <td>http://dbpedia.org/resource/Romeo_Is_Bleeding</td>\n",
       "      <td>Peter Medak</td>\n",
       "      <td>Roy Scheider,Annabella Sciorra,Lena Olin,Gary ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3596</td>\n",
       "      <td>Screwed (2000)</td>\n",
       "      <td>http://dbpedia.org/resource/Screwed_(2000_film)</td>\n",
       "      <td>Scott Alexander</td>\n",
       "      <td>Sarah Silverman,Danny DeVito,Norm Macdonald,El...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>3682</td>\n",
       "      <td>Magnum Force (1973)</td>\n",
       "      <td>http://dbpedia.org/resource/Magnum_Force</td>\n",
       "      <td>Ted Post</td>\n",
       "      <td>Clint Eastwood,Robert Urich,David Soul,Tim Mat...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     id                     movie  \\\n",
       "0   781    Stealing Beauty (1996)   \n",
       "1  1799      Suicide Kings (1997)   \n",
       "2   521  Romeo Is Bleeding (1993)   \n",
       "3  3596            Screwed (2000)   \n",
       "4  3682       Magnum Force (1973)   \n",
       "\n",
       "                                               uri             director  \\\n",
       "0      http://dbpedia.org/resource/Stealing_Beauty  Bernardo Bertolucci   \n",
       "1        http://dbpedia.org/resource/Suicide_Kings       Peter O'Fallon   \n",
       "2    http://dbpedia.org/resource/Romeo_Is_Bleeding          Peter Medak   \n",
       "3  http://dbpedia.org/resource/Screwed_(2000_film)      Scott Alexander   \n",
       "4         http://dbpedia.org/resource/Magnum_Force             Ted Post   \n",
       "\n",
       "                                            starring  \n",
       "0  Sinéad Cusack,Joseph Fiennes,Rachel Weisz,Jere...  \n",
       "1  Henry Thomas,Denis Leary,Christopher Walken,Ja...  \n",
       "2  Roy Scheider,Annabella Sciorra,Lena Olin,Gary ...  \n",
       "3  Sarah Silverman,Danny DeVito,Norm Macdonald,El...  \n",
       "4  Clint Eastwood,Robert Urich,David Soul,Tim Mat...  "
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# creating a blank series \n",
    "director = pd.Series([]) \n",
    "starring = pd.Series([]) \n",
    "\n",
    "for i in range(len(df)):\n",
    "    uri=df[\"uri\"][i]\n",
    "    dict_info = query_sparql(uri)\n",
    "    director[i] = dict_info['director']\n",
    "    \n",
    "    #Convertir lista actores a string separados por coma\n",
    "    my_string = ','.join(dict_info['starring'])\n",
    "    starring[i] = my_string\n",
    "    #print(uri)\n",
    "    \n",
    "# inserting new column with values of list made above         \n",
    "df.insert(3, \"director\", director) \n",
    "df.insert(4, \"starring\", starring) \n",
    "# list output \n",
    "df.head() "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [],
   "source": [
    "csv_name = \"movies1_info.csv\"\n",
    "df.to_csv(csv_name, index=False, sep=';')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
